# Практика: Приведение типов
# Выведите на экран при помощи print() результат работы:



# float('1')  # False
# int('2.5')  # False
# bool(1)     # True
# bool('')    # False
# bool(0)     # False

print(float('1'))
print(int('2.5'))
print(bool(1))
print(bool(''))
print(bool(0))
