# Цикл
# Ввести с клавиатуры строку.
# Вывести эту же строку вертикально: по одному символу на строку консоли.



user_type = input('Введите слово: ')

for i in user_type:
    print(i)


