# Цикл
# Создать список из десяти целых чисел.
# Вывести на экран каждое число, увеличенное на 1.

my_list = [3, 6, 5, 87, 7, 45, 13, 34, 16, 28]

for i in my_list:
    print(i + 1)
